# Taps
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# Binaries
brew "bash"
brew "bat"
brew "coreutils"
brew "ffmpeg"
brew "gh"
brew "git"
brew "grep"
brew "httpie"
brew "jq"
brew "mackup"
brew "svn"

# Development
brew "imagemagick"
brew "yarn"

# Apps
cask "google-chrome"
cask "visual-studio-code"

# Quick Look
cask "qlmarkdown"
cask "quicklook-json"

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store

#Others
# Install maven but without dependencies 
# brew install --ignore-dependencies maven
